dict01 = [
    {"國旅券": ['21', '32', '67', '97', '98', '410']},
    {"i 原券": ['64', '85']},
    {"農遊券": ['32', '54', '89', '152', '453', '597']},
    {"地方創生券": ['081', '105', '594', '188', '089', '396', '521', '912', '467', '798', '358', '441', '367', '941',
               '335']},
    {"數位藝fun券": ['07', '11', '15', '19', '30', '73', '96', '98']},
    {"紙本藝fun券": ['08', '14', '23', '36', '37', '39', '75', '79']},
    {"動茲券": ['13', '19', '55', '71', '93', '97', '381', '453', '644', '734', '985']},
    {"客庄券": ['81', '900']}
]
flag = False
number = input("請輸入數字:")
for y in range(len(dict01)):
    for k, v in dict01[y].items():
        for i in range(len(v)):
            if len(v[i]) == 2:
                if number[-2:] == v[i]:
                    print("中了" + k)
                    flag = True
            else:
                if number[-3:] == v[i]:
                    print("中了" + k)
                    flag = True

if not flag:
    print('沒中獎')
